---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SteelElementFailures.SteelElementPropagationTaskNotFinished
source: html/42d4df26-a6f7-3089-3484-60e76a12aa4f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SteelElementFailures.SteelElementPropagationTaskNotFinished Property

Advance Steel propagation tasks not finished.

## Syntax (C#)
```csharp
public static FailureDefinitionId SteelElementPropagationTaskNotFinished { get; }
```